// 14.	Напишите две функции X4(x1,y1,x2,y2,x3,y3) и Y4(x1,y1,x2,y2,x3,y3), которые дают абсциссу и ординату
// 		четвертой вершины, по заданным координатам (xi,yi), i=1,2,3 остальных трех вершин прямоугольника
// 		(в любом порядке)
function X4(x1,y1,x2,y2,x3,y3) {
	if (x1==x2)
		return 'x4 = '+x3;
	if (x2==x3)
		return 'x4 = '+x1;
	if (x1==x3)
		return 'x4 = '+x2;
}
function Y4(x1,y1,x2,y2,x3,y3) {
	if (y1==y2)
		return 'y4 = '+y3;
	if (y2==y3)
		return 'y4 = '+y1;
	if (y1==y3)
		return 'y4 = '+y2;
}